#module containing all neded strings
#also in future may be used for loading translation files
#-------------------------------------------------
#                    TEXT
#-------------------------------------------------

hello_message = '<b>Приветсвую !</b>\nКороче да я бот\nМой создатель: <b>Олег Кисиль</b>!\nТы можешь к нему обращаться если будут какие либо вопросы.\nТак-же если хочешь узнать как работает этот бот можешь посмотреть исзодный код на <a href="https://github.com/Nereg/MyStatTelegramBot">github</a>\n<b>Удачи!</b>'

help_message = '<b>Нужна помощь?</b>\nНе проблемма!\n Я имею несколько команд и вот их списокю\n/help - выводит эту помощь\n/top -  выводит топ группы и потока !\n/subscribe - подписаться на уведомления.\nТак-же если думаешь что какая то моя часть работает неправильно или я не отвечаю можешь обратьться к моему создателю\n Кстати вот <a href="tg://user?id={}">ссылочка</a> на него'

notify_message = '<b>Уведомления</b>\nПока что в боте есть только один тип уведомлений : о новом дз.\n Скоро появятся и другие\nА пока подпишись на эти с помощью: /subscribe\n(Кстати скоро должны появиться более точные уведомления о новых дзшках! Только они потребуют логина в майстат)'

subscribe_help_message = 'Выбери на какую рассылку ты хочешь подписаться:'

share_message = "Как приятно что ты хочешь поделиться с кем ни будь !\nВот ссылка на меня : <a href='{}'>{}</a>"

notification_messages = ['',
        "Появилось новое домашнее задание!",
]

error_messages =[
        "Я тебя не очень понял. Можешь попробуешь еще раз ?",
        "Ем а что это такое? Я не понимаю что ты от меня хочешь!",
        "Извини но у меня еще нету искуственного интелекта и я не очень понял что ты от меня хочешь.",
        ]
